blocks/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fluidInlet
    {
        type            patch;
        nFaces          152;
        startFace       28246;
    }
    fluidOutlet
    {
        type            patch;
        nFaces          152;
        startFace       28398;
    }
    fluidExternal
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1504;
        startFace       28550;
    }
    solidBase
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1956;
        startFace       30054;
    }
)

// ************************************************************************* //
